app/controllers/acontecimentos_controller.rb

SELECT "acontecimentos".* FROM "acontecimentos"
---
  def index
    @acontecimentos = Acontecimento.all