app/controllers/acontecimentos_controller.rb

  def create
    #Construção de um comentário dentro do post.
    @acontecimento = @politico.acontecimento.build(acontecimento_params)
    @acontecimento.save
---
INSERT INTO "acontecimentos" ("titulo", "descricao", "link", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["titulo", "Impeachment"], ["descricao", "Dilma sofre impedimento"], ["link", "www.g1.com.br"], ["created_at", "2016-05-06 17:48:37.589068"], ["updated_at", "2016-05-06 17:48:37.589068"]]

    def set_acontecimento
      set_politico
      @acontecimento = @politico.acontecimentos.find(params[:id])
---
SELECT  "acontecimentos".* FROM "acontecimentos" WHERE "acontecimentos"."id" = ? LIMIT 1  [["id", 1]]