app/controllers/partidos_controller.rb

SELECT "partidos".* FROM "partidos"
---
  def index
    @partidos = Partido.all

INSERT INTO "partidos" ("nome", "descricao", "sigla", "numero_politicos", "legenda", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @partido = Partido.new(partido_params)

    respond_to do |format|
      if @partido.save

DELETE FROM "partidos" WHERE "partidos"."id" = ?  [["id", 1]]
---
  def destroy
    @partido.destroy

SELECT  "partidos".* FROM "partidos" WHERE "partidos"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_partido
      @partido = Partido.find(params[:id])