app/controllers/politicos_controller.rb

  def index
    @politicos = Politico.all
---
SELECT "politicos".* FROM "politicos"

  def create
    @politico = Politico.new(politico_params)

    respond_to do |format|
      if @politico.save
---
INSERT INTO "politicos" ("nome", "idade", "estado", "cidade", "municipio", "partido_id", "cargo_eleito", "cargo_atual", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_politico
      @politico = Politico.find(params[:id])
---
SELECT  "politicos".* FROM "politicos" WHERE "politicos"."id" = ? LIMIT 1  [["id", 1]]